Repository: bigote/Tkabber-Wiki-Translation
Catalog: ru_en/tkabber-wiki-omegat.tmx
Source language: ru
Languages: en_us

source: Модуль Autoaway сравнивает текущее время неактивности со значением тайм-аута, и если тайм-аут меньше, Ткаббер переводится в режим "Отошёл".
en_us: The Autoaway module compares your current inactivity time to the calculated autoaway value, and if the timeout is less than your inactivity period, Tkabber goes to the "Away" status.

source: Как видите, при тайм-ауте две минуты и больше Ткаббер всегда будет считать, что мы "отошли".
en_us: As you can see, the timeout of 2 minutes and more will always give negative values that are always less than any inactivity time (even zero).

source: Такая проблема существует, в частности, в официальном [[Дистрибутивы, которые мы выбираем#Прилавок|Ткаббер-паке]] под Windows версии 0.9.8 и в официальном старпаке под Windows версии 0.9.9.
en_us: This problem exists in the official Windows [[Tkabber Distros#Counter|Tkabber Pack]] 0.9.8 and in the official Windows Starpack 0.9.9.

source: '''Решение:'''
en_us: '''Solution:'''

source: Достаточно пойти в настройки плагина '''AutoAway''' '''(Tkabber &rarr; Настройки &rarr; AutoAway)''' и установить там параметры <tt>plugins::autoaway::options(awaytime)</tt> и <tt>plugins::autoaway::options(xatime)</tt> в некоторое разумное количество <em>минут.</em>
en_us: Go to '''Tkabber &rarr; Customize &rarr; AutoAway''' and set up the parameters <tt>plugins::autoaway::options(awaytime)</tt> and <tt>plugins::autoaway::options(xatime)</tt> to some reasonable amounts of <em>minutes.</em>

source: Не забудьте сохранить <em>каждую</em> настройку "для текущей и следующих сессий", выбрав соответствующий пункт в меню, вызываемом кнопками "Состояние".
en_us: Don't forget to save <em>every</em> setting "for current and future sessions", choosing the corresponding menu item you get pressing the "State button".

source: '''Обратите внимание''' на то, что под Windows автоэвей несколько глюковат (по-видимому, из-за глюков расширения '''tclWinidle''').
en_us: '''Note''' that under Windows autoaway is a bit crappy (probably, due to the '''tclWinidle''' extension bugs).

source: Это выражается в том, что при некоторых (так пока и не зафиксированных) условиях Ткаббер ни с того ни с сего переводит вас в состояние "extended away".
en_us: Sometimes Tkabber goes to "extended away" without any obvious reason.

source: Если это произошло, вам придётся рестартовать Ткаббер или, если вы готовы пожертвовать работой автоэвея в течение данного сеанса работы, поставьте оба тайм-аута в 0 и сохраните обе настройки <em>"для текущей сессии",</em> после чего выберите вручную нужное вам состояние доступности.
en_us: If it happens, you have to restart it or, if you're ready to sacrifice your autoaway ability in this session, just set both timeouts to 0 and save both settings <em>"for current session",</em> and then choose the desired status manually.

source: Кардинальным способом борьбы с этим багом является установка Tcl/Tk 8.5, который имеет встроенные средства для отслеживания неактивности пользователя, и Ткаббер (начиная с версии 0.10.0) использует эти средства.
en_us: This bug can be fixed by installing Tcl/Tk 8.5 which has integrated tools to check user's inactivity, and Tkabber (beginning with the version 0.10.0) uses these tools.

source: Расширение '''tclWinidle''' (как и '''tkXwin''' под X Window) становится при этом ненужным.
en_us: The extension '''tclWinidle''' (as well as '''tkXwin''' under X Window) becomes unnecessary and you can uninstall it.

source: Ещё один кардинальный способ описан [[Tkinactive|тут]].
en_us: Another radical way of fixing this bug is described [[Tkinactive|here]].

source: '''Вопрос: Не могу приконнектиться к серверу через прокси (аська работает).'''
en_us: '''Question: I cannot connect to a jabber-server via proxy (ICQ works fine).'''

source: Ответ: Вариантов обычно два:
en_us: Answer: There are usually two causes that lead to this:

source: * Кривая настройка прокси-сервера в Ткаббере;
en_us: * Bad settings of your proxy-server in Tkabber;

source: * Прокси-сервер не пропускает соединения методом CONNECT на порты, отличные от 443 (HTTPS) (туда часто направляют "аську"), а Jabber-сервер обычно принимает соединения на следующие два порта:
en_us: * The proxy server denies connections made using HTTP CONNECT to all ports but 443 (HTTPS) (this port is often used by ICQ), and Jabber-server usually listens two following ports:

source: ** 5222 &mdash; поддерживается "plaintext" (соединение без шифрования) и протокол STARTTLS, позволяющий использовать SSL;
en_us: ** 5222 &mdash; plaintext connection (without encryption) and STARTTLS protocol that allows using SSL are supported;

source: ** 5223 &mdash; только SSL.
en_us: ** 5223 &mdash; SSL only.

source: Подробное описание обходных манёвров для решения второй проблемы читайте [[Между офлайном и онлайном#Подключение к XMPP серверу: практика|здесь]].
en_us: Read more about the second problem solution [[Between Offline And Online#Connection To An XMPP Server: A Practical Guide|in the following article]].

source: '''Вопрос: Psi и Gajim умеют не разрывать соединение или же пересоединяются к серверу при разрыве связи.
en_us: '''Question: Psi and Gajim are able to keep the connection or reconnect to a server if it is broken.

source: Ткаббер вроде бы этого не делает.
en_us: It seems that Tkabber doesn't do that.

source: В чём проблема?'''
en_us: Which is the problem?'''

source: Ответ: Точный ответ на этот вопрос затруднён несколькими обстоятельствами:
en_us: Answer: It's difficult to give an exact answer because of some facts:

source: * Разные люди подразумевают разные вещи под понятием "keep alive";
en_us: * Different people understand different things by a term "keep alive";

source: * Многие не понимают принципов работы протокола TCP (поверх которого "ездит" XMPP (он же Jabber)) и того, как он обрабатывает "внешние" разрывы соединений.
en_us: * Many people don't understand how TCP works (which serves as a base of XMPP/Jabber) and how it processes "external" disconnections.

source: То, что называется "keepalive" в Ткаббере, представляет собой периодическую запись пробела (символа с кодом 0x20) в исходящий XML-поток.
en_us: What is called as "keepalive" in Tkabber is a periodical sending to an outgoing XML stream a "space" character (a character with a code 0x20).

source: С точки зрения синтаксиса и семантики XML это никак не влияет на передачу данных, но зато позволяет <em>удерживать прокси-серверы и NATP-устройства от разрыва соединения из-за его неактивности</em>.
en_us: In terms of XML syntax and semantics, it doesn't affect data transfer; however, it helps <em>keep proxy-servers and NATP-devices from breaking a connection due to its inactivity</em>.

source: Про настройку этого keepalive читайте в официальной документации.
en_us: Please refer to the official Tkabber docs about configuring this "keepalive".

source: "Системный keepalive" &mdash; на уровне TCP-сокетов &mdash; напрямую в Ткаббере не поддерживается (и не будет в обозримом будущем из-за ограничений поддержки TCP-сокетов в тикле), однако, недавно появилась <em>тестовая</em> версия [[Плагины#so_keepalive|плагина, добавляющего такую поддержку]].
en_us: Tkabber doesn't support directly so-called "system keepalive" on TCP-sockets level, (and it won't support it in a proximate future due to limitations of TCP-sockets support in Tcl); however, there is <em>a test</em> version of [[Plugins#so_keepalive|a plugin that adds such support]].

source: Требуется серьёзное <em>целенаправленное</em> тестирование этого плагина на различных платформах.
en_us: This plugin needs to be seriously and <em>purposefully</em> tested on different platforms.

source: Другими словами, не думайте, что, установив этот плагин, вы разом решите все проблемы с печально известной неспособностью Ткаббера обнаруживать разорвавшиеся соединения, так как:
en_us: In other words, don't think that after installing this plugin all the problems with infamous inability of Tkabber to detect broken connections will be resolved automatically, since:

source: * Требуется настройка системы для того, чтобы "keepalive на сокетах" делал то, что Вам от него нужно;
en_us: * You'll need to configure your system so that "keepalive on sockets" would do what You want.

source: * Реакция Ткаббера на разрыв соединения вследствие срабатывания соответствующего механизма keepalive неизвестна.
en_us: * It is unknown how Tkabber would behave after triggering of some keepalive mechanism and consequent connection break.

source: {{todo|расписать подробно про системный keepalive?}}
en_us: {{todo|explain in more details about system keepalive?}}

source: По поводу настройки системы почитайте [http://chatlogs.jabber.ru/tkabber@conference.jabber.ru/2006/08/09.html#00:43:46 вот этот трёп] между [[Участник:Kostix|Kostix]] и j-dreamer, а также README в плагине.
en_us: You can read about system configuration [http://chatlogs.jabber.ru/tkabber@conference.jabber.ru/2006/08/09.html#00:43:46 this conversation] (in Russian) between [[User:Kostix|Kostix]] and j-dreamer, and also the plugin's README file.

source: {{todo|вынести этот чатлог в отдельную страницу, облагородив, т.е. он со временем отэкспайрится и будет удалён на сервере}}
en_us: {{todo|copy that conversation to a separate wiki article and edit it dropping phrases that have nothing to do with the matter}}

source: '''Вопрос: Открыл в конфе грифельную доску, теперь не могу её прикончить, она при каждом входе появляется.'''
en_us: '''Question: I opened whiteboard in my room and now I can't get rid of it, it keeps appearing every time I enter it, and it annoys everybody else!'''

source: Ответ: Всё правильно.
en_us: Answer: It's correct.

source: "Сообщения" доски выводятся как часть истории разговора в конференции.
en_us: Whiteboard "messages" are part of conference history so they appear if you have configured the client to show history when entering a room.

source: Вывод: чтобы избавиться от неё, надо затереть историю другими сообщениями, то есть банально поразговаривать.
en_us: To git rid of them you need to get rid of old history, i.e. to speak a little bit.

source: И наоборот, если вам нужно быстро затереть историю малопосещаемой комнаты, где история естественным путём обновляется редко, а тут зашёл спамер или хулиган и наспамил или наматерился, то можно открыть доску и нарисовать чего-нибудь, чтобы нежелательный текст ушёл в туман.
en_us: On the contrary, if you need to erase history of some room where there are very few visitors and it refreshes too slowly (for instance, you need to get rid of spam messages left by some idiot), you can open the whiteboard and draw something so that unwanted text disappeared from the history.

source: Естественно, теперь начнёт доставать доска, но её мы убивать уже умеем ;) Количественные параметры для затирания того и другого предлагается определить самостоятельно.
en_us: Of course, now we get annoying whiteboard but we already know what to do ;) It's your task now to determine how many squares and circles are required to erase spam and how many greetings are required to erase polygons.

source: '''Вопрос: Указываю путь до каталога с сертификатами, среди которых есть сертификат для коннекта с серверу, но Ткаббер не видит нужный сертификат (например, ругаясь на то, что сертификат сервера самоподписан или имеет в цепочке доверенных сертификатов самоподписанный сертификат).'''
en_us: '''Question: I provide a path to a certificate directory where there are a certificate for connection to a server, but Tkabber can't see a necessary certificate (for instance, it says that the server certificate is self-signed or it has a self-signed certificate in its chain of trusted certificates).

source: Ответ: Подробный рассказ про сертификаты ЦС и Ткаббер находится [[Проверка сертификата сервера#Практика|здесь]].
en_us: Answer: A very detailed article about CA, certificates and Tkabber can be found [[Server Certificate Verification#Practice|here]].

source: '''Вопрос: Пытаюсь отредактировать закладку конференции в списке контактов &mdash; например, включить автовход для этой конференции, &mdash; однако, в появившемся диалоге могу изменить только "ник" конференции.
en_us: '''Question: I'm trying to edit a conference bookmark in my roster so that, for instance, to enable autojoin to it; however, I'm only able to change the "nick" of this conference.

source: Ответ: Проблема в том, что помимо <em>закладки,</em> ссылающейся на JID комнаты, у вас в списке контактов есть <em>контакт</em> с таким же JID.
en_us: Answer: The problem is that besides of <em>a bookmark</em> in you r roster that refers to a room's JID you have <em>a contact</em> with the same JID.

source: Подробное описание проблемы дано чуть ниже, а метод борьбы с этим недугом один: удалите закладку (через её контекстного меню) &mdash; при этом удалится как закладка, так и "замаскированный" ею элемент списка контактов, после чего добавьте нужную конференцию в закладки ещё раз &mdash; из меню чата в конференции или из главного меню ("Службы" &rarr; "Добавить конференцию в контакты...").
en_us: The problem is explained below and here is given the only way to arrange it: delete the bookmark (via its context menu) &mdash; it will delete both the bookmark and a corresponding roster element, after that just add a needed conference once more &mdash; via chat menu or main menu: '''Services &rarr; Add conference to the roster...'''.
